# Переменные для подключения к PostgreSQL
POSTGRES_CONN_ID = "stg_conn"
POSTGRES_CONN_TYPE = "postgres"
POSTGRES_HOST = "localhost"
POSTGRES_LOGIN = "ibbvs"
POSTGRES_PASSWORD = "12345"
POSTGRES_PORT = "5432"
POSTGRES_SCHEMA = "database"
POSTGRES_DB_NAME = "stg_hh"
POSTGRES_TABLE_NAME = "stg_vacancies"




# URL для доступа к API вакансий на сайте hh.ru
URL = "https://api.hh.ru/vacancies"

# Список запросов для поиска вакансий
QUERY_TITLES = ["Python Data Engineer", "Python Data Analyst", "Python Дата инженер", "Python Дата аналитик", "Python Инженер данных", "Python Аналитик данных", "Data Scientist", "BI разработчик"]

# Список ключевых слов, которые необходимо исключить из результатов поиска
EXCLUDE_QUERY = ["backend", "back", "front", "frontend", "дизайнер", "бизнес", "товародвижение", "react", "информационный", "системный", "юрист", "меню", "devops", "java", "эксплуатация", "управление",
                 "c++", "c", "js", "продуктовый", "product", "тестировщик", "тестирование", "биоинформатика", "картограф", "гис", "сеть", "director", "экономист", "администратор", "project", "консультант",
                 "qa", "директор", "руководитель", "лингвист", "телекоммуникационный", "сетевой", "цод", "менеджер", "безопасность", "дежурный", "вентиляция", "портфельный", "инженерный", "клиентский", "эконометрист",
                 "финансовый", "маркетолог", "фронтенд", "энергетик", "поддержка", "архив", "marketing", "пто", "javascript", "full", "fullstack", "смк", "охрана", "сметчик", "конструктор", "заместитель", "надзорный",
                 "сервисный", "оператор", "рассмотрение", "закупка", "ассистент", "персональный", "координатор", "инвестиционный", "методолог", "бухгалтер", "бпнуть", "сопровождение", "soc", "нвк", "бурение",
                 "документовед", "архивариус", "гарантия", "ведущий", "асу", "схемотехник", "радиотехник", "наладочный", "кипиа", "мониторинг", "документооборот", "fronted", "монтаж", "электронщик", "эколог"]


